In [1]:
import pandas as pd

PANDAS DATA STRUCTURE

In [2]:
#SERIES

s1 = pd.Series([11,22,33,44,55,66,77,88,99,110,"midha",0.4])
s1 #pandas series object (it returns index also)

0        11
1        22
2        33
3        44
4        55
5        66
6        77
7        88
8        99
9       110
10    midha
11      0.4
dtype: object

In [47]:
s1[9] #accessing value by index

110

In [48]:
s1[[2,3,0,8]] #it accepts parameter as a bunch

2    33
3    44
0    11
8    99
dtype: object

In [49]:
s1[5] = 87 #modifying value in series
#s1[5.1] = 87 is also possible

In [29]:
s1[[1,2,3,4]] = [23,33,45,67] #modyfying multiple values

In [50]:
del s1[5] #deleting a value in series (multiple del is not working)

In [51]:
s1

0        11
1        22
2        33
3        44
4        55
6        77
7        88
8        99
9       110
10    midha
11      0.4
dtype: object

In [53]:
s1[12] = 34  #insert in a series with a new index

In [54]:
s1

0        11
1        22
2        33
3        44
4        55
6        77
7        88
8        99
9       110
10    midha
11      0.4
12       34
dtype: object

In [59]:
s2 = pd.Series([10,20,30,40], index = ["oranges","apples","bananas","kiwi"])

In [63]:
s2.index

Index(['oranges', 'apples', 'bananas', 'kiwi'], dtype='object')

In [60]:
s2

oranges    10
apples     20
bananas    30
kiwi       40
dtype: int64

In [64]:
s2.values

array([10, 20, 30, 40], dtype=int64)

In [66]:
ourindex = ["oranges","apples","bananas","kiwi"]

In [67]:
s3 = pd.Series([10,20,30,40],index = ourindex)

In [68]:
s3

oranges    10
apples     20
bananas    30
kiwi       40
dtype: int64

In [ ]:
#index cannot be modified

In [69]:
s3>30

oranges    False
apples     False
bananas    False
kiwi        True
dtype: bool

In [70]:
s3[s3>30]

kiwi    40
dtype: int64

In [71]:
"oranges" in s3

True

In [73]:
"peech" in s3

False

In [76]:
obj = pd.Series([3,8,1,7,9,4])
obj.rank()

0    2.0
1    5.0
2    1.0
3    4.0
4    6.0
5    3.0
dtype: float64

# CREATING A SERIES BY USING DICTIONARY

In [80]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
data = pd.Series(sdata)
data

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [90]:
states = ["california","Ohio","Texas","Oregon"]
data1 = pd.Series(sdata, index = states)
data1

california        NaN
Ohio          35000.0
Texas         71000.0
Oregon        16000.0
dtype: float64

In [94]:
data1.notnull()

california    False
Ohio           True
Texas          True
Oregon         True
dtype: bool

# DATA FRAMES

In [96]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [98]:
df1 = pd.DataFrame(data)
df1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [103]:
myself = {'friends': ['sabika','warda','zehra','amna','hasham','mariam'],
         'fname': ['taqvi','rehan','sadia','mujahid','khalid','naz'],
          'age' : [21,20,20,20,18,19],}
mydata = pd.DataFrame(myself)
mydata

  friends    fname  age
0  sabika    taqvi   21
1   warda    rehan   20
2   zehra    sadia   20
3    amna  mujahid   20
4  hasham   khalid   18
5  mariam      naz   19

In [104]:
type(df1)

pandas.core.frame.DataFrame

In [106]:
df1.shape

(6, 3)

In [108]:
df1['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [109]:
df1.pop

<bound method NDFrame.pop of     state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2>

In [110]:
df1[['pop','state']]

   pop   state
0  1.5    Ohio
1  1.7    Ohio
2  3.6    Ohio
3  2.4  Nevada
4  2.9  Nevada
5  3.2  Nevada

In [111]:
del df1["pop"] #deleting a column

In [112]:
df1

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001
4  Nevada  2002
5  Nevada  2003

In [113]:
df1["debt"] = [100,200,300,400,500,600]
df1

    state  year  debt
0    Ohio  2000   100
1    Ohio  2001   200
2    Ohio  2002   300
3  Nevada  2001   400
4  Nevada  2002   500
5  Nevada  2003   600

In [114]:
df1['debt'] = range(6)
df1

    state  year  debt
0    Ohio  2000     0
1    Ohio  2001     1
2    Ohio  2002     2
3  Nevada  2001     3
4  Nevada  2002     4
5  Nevada  2003     5

In [116]:
df1['debt'] = df1['state']
df1

    state  year    debt
0    Ohio  2000    Ohio
1    Ohio  2001    Ohio
2    Ohio  2002    Ohio
3  Nevada  2001  Nevada
4  Nevada  2002  Nevada
5  Nevada  2003  Nevada

In [2]:
dic = {
    "Ai for EO": [78,89,98,90,87,86],
    "Python 1" : [12,29,58,59,88,89],
    "Python 2" : [12,23,55,87,97,89],
}
df = pd.DataFrame(dic,index = ["Nasir","Asad","Ramsha","Mansoor","Saba","Hina"])
df

         Ai for EO  Python 1  Python 2
Nasir           78        12        12
Asad            89        29        23
Ramsha          98        58        55
Mansoor         90        59        87
Saba            87        88        97
Hina            86        89        89

In [3]:
df['total_marks'] = df["Ai for EO"] + df["Python 1"] + df["Python 2"]
df

         Ai for EO  Python 1  Python 2  total_marks
Nasir           78        12        12          102
Asad            89        29        23          141
Ramsha          98        58        55          211
Mansoor         90        59        87          236
Saba            87        88        97          272
Hina            86        89        89          264

In [4]:
df['total_marks']

Nasir      102
Asad       141
Ramsha     211
Mansoor    236
Saba       272
Hina       264
Name: total_marks, dtype: int64

In [5]:
df['criteria'] = df['total_marks']>200

In [6]:
df

         Ai for EO  Python 1  Python 2  total_marks  criteria
Nasir           78        12        12          102     False
Asad            89        29        23          141     False
Ramsha          98        58        55          211      True
Mansoor         90        59        87          236      True
Saba            87        88        97          272      True
Hina            86        89        89          264      True

In [7]:
df['criteria'] = ["Pass" if marks>200 else "Fails" for marks in df.total_marks]
df

         Ai for EO  Python 1  Python 2  total_marks criteria
Nasir           78        12        12          102    Fails
Asad            89        29        23          141    Fails
Ramsha          98        58        55          211     Pass
Mansoor         90        59        87          236     Pass
Saba            87        88        97          272     Pass
Hina            86        89        89          264     Pass

In [8]:
df['percentage'] = df["total_marks"] / 300 *100

In [9]:
df['status'] = ["Pass" if a>=33 and p1>=33 and p2>=33 else "Fails" for a,p1,p2 in zip(df["Ai for EO"],df["Python 1"],df["Python 2"])]
df

,Ai for EO,Python 1,Python 2,total_marks,criteria,percentage,status
Nasir,78,12,12,102,Fails,34.000000,Fails
Asad,89,29,23,141,Fails,47.000000,Fails
Ramsha,98,58,55,211,Pass,70.333333,Pass
Mansoor,90,59,87,236,Pass,78.666667,Pass
Saba,87,88,97,272,Pass,90.666667,Pass
Hina,86,89,89,264,Pass,88.000000,Pass

In [201]:
a = list(range(5))
b = list(range(1,6))
print(a)
print(b)
c = zip(a,b)
for i in c:
    print(i)

[0, 1, 2, 3, 4]
[1, 2, 3, 4, 5]
(0, 1)
(1, 2)
(2, 3)
(3, 4)
(4, 5)

In [11]:
import numpy as np

In [13]:
df['status2'] = np.where(((df['Ai for EO']<50)&(df['Python 1']<50)&(df['Python 2']<50)),"Pass","Fail")
df

,Ai for EO,Python 1,Python 2,total_marks,criteria,percentage,status,status2
Nasir,78,12,12,102,Fails,34.000000,Fails,Fail
Asad,89,29,23,141,Fails,47.000000,Fails,Fail
Ramsha,98,58,55,211,Pass,70.333333,Pass,Fail
Mansoor,90,59,87,236,Pass,78.666667,Pass,Fail
Saba,87,88,97,272,Pass,90.666667,Pass,Fail
Hina,86,89,89,264,Pass,88.000000,Pass,Fail

In [202]:
df.head() #by default it returns 5 data

,Ai for EO,Python 1,Python 2,total_marks,criteria,percentage,status
Nasir,78,12,12,102,Fails,34.000000,Fails
Asad,89,29,23,141,Fails,47.000000,Fails
Ramsha,98,58,55,211,Pass,70.333333,Pass
Mansoor,90,59,87,236,Pass,78.666667,Pass
Saba,87,88,97,272,Pass,90.666667,Pass

In [203]:
df.head(3) #we can define also how many to return

        Ai for EO  Python 1  Python 2  total_marks criteria  percentage status
Nasir          78        12        12          102    Fails   34.000000  Fails
Asad           89        29        23          141    Fails   47.000000  Fails
Ramsha         98        58        55          211     Pass   70.333333   Pass

In [204]:
df.tail() #last five data returns

,Ai for EO,Python 1,Python 2,total_marks,criteria,percentage,status
Asad,89,29,23,141,Fails,47.000000,Fails
Ramsha,98,58,55,211,Pass,70.333333,Pass
Mansoor,90,59,87,236,Pass,78.666667,Pass
Saba,87,88,97,272,Pass,90.666667,Pass
Hina,86,89,89,264,Pass,88.000000,Pass

In [205]:
df.tail(6)

,Ai for EO,Python 1,Python 2,total_marks,criteria,percentage,status
Nasir,78,12,12,102,Fails,34.000000,Fails
Asad,89,29,23,141,Fails,47.000000,Fails
Ramsha,98,58,55,211,Pass,70.333333,Pass
Mansoor,90,59,87,236,Pass,78.666667,Pass
Saba,87,88,97,272,Pass,90.666667,Pass
Hina,86,89,89,264,Pass,88.000000,Pass

In [206]:
df.loc["Hina"]

Ai for EO        86
Python 1         89
Python 2         89
total_marks     264
criteria       Pass
percentage       88
status         Pass
Name: Hina, dtype: object

In [211]:
df.loc["Asad":"Hina"] #hina is also inclusive

,Ai for EO,Python 1,Python 2,total_marks,criteria,percentage,status
Asad,89,29,23,141,Fails,47.000000,Fails
Ramsha,98,58,55,211,Pass,70.333333,Pass
Mansoor,90,59,87,236,Pass,78.666667,Pass
Saba,87,88,97,272,Pass,90.666667,Pass
Hina,86,89,89,264,Pass,88.000000,Pass

In [214]:
df.iloc[0] #by default indexing hai mojod kahin

Ai for EO         78
Python 1          12
Python 2          12
total_marks      102
criteria       Fails
percentage        34
status         Fails
Name: Nasir, dtype: object

In [216]:
df.iloc[0:3] #3 is exclusive here

        Ai for EO  Python 1  Python 2  total_marks criteria  percentage status
Nasir          78        12        12          102    Fails   34.000000  Fails
Asad           89        29        23          141    Fails   47.000000  Fails
Ramsha         98        58        55          211     Pass   70.333333   Pass

In [217]:
df.loc['Nasir']['Python 2']

12

In [218]:
df.loc["midha"] = [96,96,93,100,"Pass",93.33,"Pass"]

In [219]:
df

,Ai for EO,Python 1,Python 2,total_marks,criteria,percentage,status
Nasir,78,12,12,102,Fails,34.000000,Fails
Asad,89,29,23,141,Fails,47.000000,Fails
Ramsha,98,58,55,211,Pass,70.333333,Pass
Mansoor,90,59,87,236,Pass,78.666667,Pass
Saba,87,88,97,272,Pass,90.666667,Pass
Hina,86,89,89,264,Pass,88.000000,Pass
midha,96,96,93,100,Pass,93.330000,Pass

In [220]:
df.iloc[::-1]

,Ai for EO,Python 1,Python 2,total_marks,criteria,percentage,status
midha,96,96,93,100,Pass,93.330000,Pass
Hina,86,89,89,264,Pass,88.000000,Pass
Saba,87,88,97,272,Pass,90.666667,Pass
Mansoor,90,59,87,236,Pass,78.666667,Pass
Ramsha,98,58,55,211,Pass,70.333333,Pass
Asad,89,29,23,141,Fails,47.000000,Fails
Nasir,78,12,12,102,Fails,34.000000,Fails

# 13-10-2019

In [3]:
import pandas as pd

In [4]:
#dataframe
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
         'year': [2000, 2001, 2002, 2001, 2002, 2003],
         'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [5]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [6]:
frame = pd.DataFrame(data,columns=['year','pop','state']) #shifting columns 
frame

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

In [7]:
frame = pd.DataFrame(data,columns=['year','pop','state'],index = [11,22,33,44,55,66]) #changing index(rows)
frame

    year  pop   state
11  2000  1.5    Ohio
22  2001  1.7    Ohio
33  2002  3.6    Ohio
44  2001  2.4  Nevada
55  2002  2.9  Nevada
66  2003  3.2  Nevada

In [8]:
frame = pd.DataFrame(data,columns=['year','pop','state','debt']) #creating a new columns without assigning their values so output is NaN
frame

   year  pop   state debt
0  2000  1.5    Ohio  NaN
1  2001  1.7    Ohio  NaN
2  2002  3.6    Ohio  NaN
3  2001  2.4  Nevada  NaN
4  2002  2.9  Nevada  NaN
5  2003  3.2  Nevada  NaN

In [10]:
frame['year']

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [12]:
frame.loc[3]

year       2001
pop         2.4
state    Nevada
debt        NaN
Name: 3, dtype: object

In [21]:
val = pd.Series([-1.2,-1.5,-1.7],index=[0,2,4])
val

0   -1.2
2   -1.5
4   -1.7
dtype: float64

In [22]:
frame.debt = val
frame

   year  pop   state  debt
0  2000  1.5    Ohio  -1.2
1  2001  1.7    Ohio   NaN
2  2002  3.6    Ohio  -1.5
3  2001  2.4  Nevada   NaN
4  2002  2.9  Nevada  -1.7
5  2003  3.2  Nevada   NaN

In [24]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [25]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [27]:
frame3 = pd.DataFrame(pop,index=[2000,2001,2003])
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2003     NaN   NaN

In [28]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [4]:
dict1 = {"Class1" : {2018:4,2019:23},
        "Class2" : {2017:5,2018:24}}
myframe = pd.DataFrame(dict1)
myframe

      Class1  Class2
2017     NaN     5.0
2018     4.0    24.0
2019    23.0     NaN

In [82]:
dict2 = {"SE": myframe["Class1"][:-1],
         "CIS":myframe["Class2"][0:]}
pd.DataFrame(dict2)

       SE   CIS
2017  NaN   5.0
2018  4.0  24.0
2019  NaN   NaN

In [42]:
frame3.index.name = 'year'
frame3.columns.name = "state"
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2003      NaN   NaN

In [46]:
print("midha") ; print("sumayya") ; print("hasham")

midha
sumayya
hasham

In [45]:
frame3.index.name = 'years' ; frame3.columns.name = 'states'
frame3

states  Nevada  Ohio
years
2000       NaN   1.5
2001       2.4   1.7
2003       NaN   NaN

In [49]:
obj = pd.Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [51]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [52]:
obj3 = pd.Series(['blue','purple','yellow'],index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [54]:
obj3.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [55]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [56]:
obj3.reindex(range(6),method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

# REINDEXING OF FRAME

In [62]:
import numpy as np

In [67]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [72]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [75]:
states = ['Texas','Utah','California']
frame2.reindex(columns=states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [76]:
#now for both index and columns
frame2.reindex(index = ['f','b','a','d','c'],columns=['Texas','NewYork','Utah','California'])

   Texas  NewYork  Utah  California
f    NaN      NaN   NaN         NaN
b    NaN      NaN   NaN         NaN
a    1.0      NaN   NaN         2.0
d    7.0      NaN   NaN         8.0
c    4.0      NaN   NaN         5.0

In [93]:
data = pd.DataFrame(np.arange(1,101).reshape((20,5)),columns=['a','b','c','d','e'],index=range(1,101,5))
data

     a   b   c   d    e
1    1   2   3   4    5
6    6   7   8   9   10
11  11  12  13  14   15
16  16  17  18  19   20
21  21  22  23  24   25
26  26  27  28  29   30
31  31  32  33  34   35
36  36  37  38  39   40
41  41  42  43  44   45
46  46  47  48  49   50
51  51  52  53  54   55
56  56  57  58  59   60
61  61  62  63  64   65
66  66  67  68  69   70
71  71  72  73  74   75
76  76  77  78  79   80
81  81  82  83  84   85
86  86  87  88  89   90
91  91  92  93  94   95
96  96  97  98  99  100

In [96]:
data = pd.DataFrame(np.arange(1,101).reshape((20,5)),columns=list('abcde'),index=range(1,101,5))
data

     a   b   c   d    e
1    1   2   3   4    5
6    6   7   8   9   10
11  11  12  13  14   15
16  16  17  18  19   20
21  21  22  23  24   25
26  26  27  28  29   30
31  31  32  33  34   35
36  36  37  38  39   40
41  41  42  43  44   45
46  46  47  48  49   50
51  51  52  53  54   55
56  56  57  58  59   60
61  61  62  63  64   65
66  66  67  68  69   70
71  71  72  73  74   75
76  76  77  78  79   80
81  81  82  83  84   85
86  86  87  88  89   90
91  91  92  93  94   95
96  96  97  98  99  100

In [97]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [98]:
frame2.loc['c'] #to access by indexes we use loc and iloc

Ohio          3.0
Texas         4.0
California    5.0
Name: c, dtype: float64

In [100]:
frame2.loc['c']['California']

5.0

In [101]:
frame2.loc['c'][2]

5.0

In [106]:
frame2.loc[::-1]

   Ohio  Texas  California
d   6.0    7.0         8.0
c   3.0    4.0         5.0
b   NaN    NaN         NaN
a   0.0    1.0         2.0

In [109]:
frame2.loc[::-1,::-1]

   California  Texas  Ohio
d         8.0    7.0   6.0
c         5.0    4.0   3.0
b         NaN    NaN   NaN
a         2.0    1.0   0.0

In [110]:
frame2.loc['a':'c']

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0

In [113]:
frame2.iloc[0:2] #exclusive

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN

In [114]:
frame2.iloc[0:3]

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0

In [117]:
frame2.loc['b']['Ohio'] = 3 #changing the value
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [128]:
frame2.loc['b'][[0,2]] = [4,6] #fancy indexing
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   4.0    NaN         6.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [129]:
frame2.loc['b'][[2,0]] = frame2.loc['b'][[0,2]]
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   6.0    NaN         4.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [132]:
frame2['Texas'][1] + 5 #nan multiplied , add, subtract with anyting ans will be nan always
#datatype float of nan , not a number

nan

In [133]:
frame4 = frame2.copy()
frame4['std'] = [4,5,7,8]
frame4

   Ohio  Texas  California  std
a   0.0    1.0         2.0    4
b   6.0    NaN         4.0    5
c   3.0    4.0         5.0    7
d   6.0    7.0         8.0    8

In [135]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   6.0    NaN         4.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [134]:
frame2 + frame4 #return in ascending order of columns name

   California  Ohio  Texas  std
a         4.0   0.0    2.0  NaN
b         8.0  12.0    NaN  NaN
c        10.0   6.0    8.0  NaN
d        16.0  12.0   14.0  NaN

In [136]:
frame2 - frame4

   California  Ohio  Texas  std
a         0.0   0.0    0.0  NaN
b         0.0   0.0    NaN  NaN
c         0.0   0.0    0.0  NaN
d         0.0   0.0    0.0  NaN

In [139]:
pd.DataFrame(pd.Series([1,2,33]))

    0
0   1
1   2
2  33

In [140]:
abs(-67)

67

In [145]:
frame4

   Ohio  Texas  California  std
a   0.0    1.0         2.0    4
b   6.0    NaN         4.0    5
c   3.0    4.0         5.0    7
d   6.0    7.0         8.0    8

In [141]:
frame4.isna() #NaN checking 2nd method

    Ohio  Texas  California    std
a  False  False       False  False
b  False   True       False  False
c  False  False       False  False
d  False  False       False  False

In [142]:
frame4[frame4.isna()]

   Ohio  Texas  California  std
a   NaN    NaN         NaN  NaN
b   NaN    NaN         NaN  NaN
c   NaN    NaN         NaN  NaN
d   NaN    NaN         NaN  NaN

In [150]:
frame4[frame4>5]

   Ohio  Texas  California  std
a   NaN    NaN         NaN  NaN
b   6.0    NaN         NaN  NaN
c   NaN    NaN         NaN  7.0
d   6.0    7.0         8.0  8.0

In [154]:
frame4.dropna()

   Ohio  Texas  California  std
a   0.0    1.0         2.0    4
b   6.0    0.0         4.0    5
c   3.0    4.0         5.0    7
d   6.0    7.0         8.0    8

In [153]:
frame4.fillna(0,inplace=True)
frame4

   Ohio  Texas  California  std
a   0.0    1.0         2.0    4
b   6.0    0.0         4.0    5
c   3.0    4.0         5.0    7
d   6.0    7.0         8.0    8